lib/tasks/admin.rake

INSERT INTO "users" ("name", "email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "admin", "street_address", "city", "postal_code", "province_id") VALUES ('Admin', 'admin@swimi.com', '$2a$12$7MQcDRlMu2UkpbElev0X/./aIaOKzG.quM3V62Czl6t8YzCJu6Mj.', NULL, NULL, NULL, '2025-08-03 22:51:13.414932', '2025-08-03 22:51:13.414932', 1, NULL, NULL, NULL, NULL) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = 'admin@swimi.com' LIMIT 1
---
  task create_user: :environment do
    puts "Creating admin user..."

    admin = User.find_or_create_by(email: 'admin@swimi.com') do |user|