app/views/devise/registrations/edit.html.erb

              <%= f.label :province_id, "Province", class: "form-label" %>
              <%= f.collection_select :province_id, Province.all, :id, :name,
                  { prompt: "Select Province" }, { class: "form-select" } %>
---
SELECT "provinces".* FROM "provinces"