app/controllers/admin/categories_controller.rb

  def index
    @categories = Category.includes(:products).order(:name).page(params[:page]).per(20)
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC LIMIT 20 OFFSET 0
SELECT "products".* FROM "products" WHERE "products"."category_id" IN (7, 6, 8, 5)
SELECT COUNT(*) FROM "products" WHERE "products"."category_id" = 7

  def show
    @products = @category.products.page(params[:page]).per(12)
---
SELECT "products".* FROM "products" WHERE "products"."category_id" = 7 LIMIT 12 OFFSET 0
SELECT COUNT(*) FROM "products" WHERE "products"."category_id" = 7

  def create
    @category = Category.new(category_params)

    if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at", "description") VALUES ('test category', '2025-08-03 22:13:24.058186', '2025-08-03 22:13:24.058186', 'This is for test') RETURNING "id"

  def update
    if @category.update(category_params)
---
UPDATE "categories" SET "updated_at" = '2025-08-03 20:19:23.085288', "description" = 'For kids under 15' WHERE "categories"."id" = 7