app/controllers/admin/dashboard_controller.rb

SELECT COUNT(*) FROM "products"
SELECT COUNT(*) FROM "categories"
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "orders"
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC LIMIT 5
SELECT "products".* FROM "products" ORDER BY "products"."created_at" DESC LIMIT 5
---
  def index
    @products_count = Product.count
    @categories_count = Category.count
    @users_count = User.count
    @orders_count = Order.count
    @recent_products = Product.order(created_at: :desc).limit(5)