app/controllers/admin/products_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (7, 8)
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 7 LIMIT 1
SELECT "products".* FROM "products" WHERE (stock > 0) ORDER BY "products"."created_at" DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "products" WHERE "products"."stock" = 0
---
  def index
    @products = Product.includes(:category)

    # Apply search filter if present
    if params[:search].present?
      @products = @products.where("name ILIKE ? OR description ILIKE ?",
                                  "%#{params[:search]}%", "%#{params[:search]}%")
    end

    # Apply category filter if present
    if params[:category_id].present?
      @products = @products.where(category_id: params[:category_id])
    end

    # Apply stock filter if present
    if params[:stock_filter].present?
      case params[:stock_filter]
      when 'in_stock'
        @products = @products.where('stock > 0')
      when 'out_of_stock'
        @products = @products.where(stock: 0)
      when 'low_stock'
        @products = @products.where('stock > 0 AND stock <= 5')
      end
    end

    @products = @products.order(created_at: :desc).page(params[:page]).per(20)

SELECT "categories".* FROM "categories"
---
  def new
    @product = Product.new
    @product.category_id = params[:category_id] if params[:category_id]
    @categories = Category.all

SELECT "categories".* FROM "categories"
INSERT INTO "products" ("name", "price", "description", "size", "stock", "image_url", "category_id", "created_at", "updated_at") VALUES ('sss', 2.0, 'DescriptionDescriptionDescriptionDescriptionDescriptionDescriptionDescriptionDescriptionDescription', '22', 2222, '', 7, '2025-08-03 19:14:40.248550', '2025-08-03 19:14:40.248550') RETURNING "id"
---
  def create
    @product = Product.new(product_params)
    @categories = Category.all

    if @product.save

SELECT "categories".* FROM "categories"
---
  def edit
    @categories = Category.all

UPDATE "products" SET "category_id" = 6, "updated_at" = '2025-08-03 22:13:06.407840' WHERE "products"."id" = 134
---
  def update
    @categories = Category.all

    if @product.update(product_params)

UPDATE "products" SET "updated_at" = '2025-08-03 22:08:26.285655' WHERE "products"."id" = 134
---
  def bulk_update
    if params[:bulk_action].present? && params[:product_ids].present?
      products = Product.where(id: params[:product_ids])

      case params[:bulk_action]
      when 'delete'
        count = products.count
        products.destroy_all
        redirect_to admin_products_path, notice: "Successfully deleted #{count} products."
      when 'mark_out_of_stock'
        products.update_all(stock: 0)
        redirect_to admin_products_path, notice: "Successfully marked #{products.count} products as out of stock."
      when 'activate'
        products.update_all(active: true)
        redirect_to admin_products_path, notice: "Successfully activated #{products.count} products."
      when 'deactivate'
        products.update_all(active: false)