app/controllers/admin/products_controller.rb

  def create
    @product = Product.new(product_params)
    @categories = Category.all

    if @product.save
---
INSERT INTO "products" ("name", "price", "description", "size", "stock", "image_url", "category_id", "created_at", "updated_at") VALUES ('sss', 2.0, 'DescriptionDescriptionDescriptionDescriptionDescriptionDescriptionDescriptionDescriptionDescription', '22', 2222, '', 7, '2025-08-03 19:14:40.248550', '2025-08-03 19:14:40.248550') RETURNING "id"