app/views/home/about.html.erb

SELECT COUNT(*) FROM "products" WHERE "products"."category_id" = 5
---
                  <h5 class="card-title"><%= category.name %></h5>
                  <p class="card-text">Explore our <%= category.products.count %> products in this category.</p>