app/views/home/index.html.erb

SELECT "categories".* FROM "categories"
---
              <div class="col-md-4">
                <%= f.select :category,
                    options_from_collection_for_select(@categories, :name, :name),
                    { prompt: "All Categories" },
                    { class: "form-select form-select-lg" } %>