app/views/orders/index.html.erb

                  <h6 class="mb-2">Items Ordered:</h6>
                  <% order.order_items.each do |item| %>
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = 6

                        <small class="text-muted d-block">
                          Size: <%= item.product.size %> | Qty: <%= item.quantity %> |
---
SELECT "products".* FROM "products" WHERE "products"."id" = 67