app/views/admin/categories/index.html.erb

              <td>
                <span class="badge bg-info"><%= category.products.count %> products</span>
---
SELECT "products".* FROM "products" WHERE "products"."category_id" IN (7, 6, 8, 5)
SELECT COUNT(*) FROM "products" WHERE "products"."category_id" = 7