app/views/admin/categories/show.html.erb

SELECT COUNT(*) FROM "products" WHERE "products"."category_id" = 7
---
        <% end %>
        <p><strong>Products:</strong> <%= @category.products.count %></p>