app/views/admin/products/index.html.erb

SELECT COUNT(*) FROM "products" WHERE (stock > 0)
---
<script>
document.addEventListener('DOMContentLoaded', function() {
  // Select all checkbox functionality
  const selectAllCheckbox = document.getElementById('select-all');
  const productCheckboxes = document.querySelectorAll('.product-checkbox');
  const bulkActionBtn = document.getElementById('bulk-action-btn');

  selectAllCheckbox.addEventListener('change', function() {
    productCheckboxes.forEach(checkbox => {
      checkbox.checked = this.checked;
    });
    toggleBulkActionButton();
  });

  productCheckboxes.forEach(checkbox => {
    checkbox.addEventListener('change', function() {
      const checkedBoxes = document.querySelectorAll('.product-checkbox:checked');
      selectAllCheckbox.checked = checkedBoxes.length === productCheckboxes.length;
      selectAllCheckbox.indeterminate = checkedBoxes.length > 0 && checkedBoxes.length < productCheckboxes.length;
      toggleBulkActionButton();
    });
  });