app/views/admin/products/show.html.erb

SELECT 1 AS one FROM "products" WHERE "products"."category_id" = 7 AND "products"."id" != 134 LIMIT 1
---
<!-- Related Products (if needed) -->
<% if @product.category.products.where.not(id: @product.id).any? %>

SELECT "products".* FROM "products" WHERE "products"."category_id" = 7 AND "products"."id" != 134 LIMIT 6
---
      <div class="row">
        <% @product.category.products.where.not(id: @product.id).limit(6).each do |related_product| %>