app/controllers/cart_controller.rb

  def show
    @cart_items = []
    invalid_items = []

    @cart.each do |product_id, quantity|
      begin
        product = Product.find(product_id)
---
SELECT "products".* FROM "products" WHERE "products"."id" = 67 LIMIT 1

  def add_item
    begin
      product = Product.find(params[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 67 LIMIT 1