app/controllers/categories_controller.rb

SELECT "products".* FROM "products" WHERE "products"."category_id" = 5 LIMIT 12 OFFSET 0
SELECT COUNT(*) FROM "products" WHERE "products"."category_id" = 5
---
  def show
    @products = @category.products.page(params[:page]).per(12)