app/controllers/checkout_controller.rb

SELECT "provinces".* FROM "provinces" ORDER BY "provinces"."name" ASC
---
  def show
    @provinces = Province.all.order(:name)

UPDATE "users" SET "updated_at" = '2025-08-03 19:43:28.225834', "street_address" = 'A514, 800 DOVERCOURT DR', "city" = 'WINNIPEG', "postal_code" = 'R3Y0R3', "province_id" = 8 WHERE "users"."id" = 22
SELECT "provinces".* FROM "provinces" WHERE "provinces"."id" = 8 LIMIT 1
INSERT INTO "orders" ("user_id", "total_price", "status", "created_at", "updated_at") VALUES (22, 141.93, 'pending', '2025-08-03 19:43:28.258397', '2025-08-03 19:43:28.258397') RETURNING "id"
INSERT INTO "order_items" ("order_id", "product_id", "quantity", "price", "created_at", "updated_at") VALUES (6, 67, 2, 63.36, '2025-08-03 19:43:28.276906', '2025-08-03 19:43:28.276906') RETURNING "id"
---
  def create_order
    @provinces = Province.all.order(:name)

    # Update user address if provided
    if params[:user].present?
      unless current_user.update(user_params)
        flash[:alert] = "Please fix the address errors."
        redirect_to checkout_path and return
      end
    end

    # Ensure user has address
    unless current_user.has_address?
      flash[:alert] = "Please provide your address to continue."
      redirect_to checkout_path and return
    end

    # Build cart items and calculate totals
    @cart_items = build_cart_items
    @subtotal = @cart_items.sum { |item| item[:total_price] }
    @tax_amount = (@subtotal * current_user.province.total_tax_rate).round(2)
    @total = @subtotal + @tax_amount

    # Create order
    @order = current_user.orders.build(
      total_price: @total,
      subtotal: @subtotal,
      tax: @tax_amount,
      status: 'pending',
      province: current_user.province,
      shipping_name: current_user.name,
      shipping_address: current_user.street_address,
      shipping_city: current_user.city,
      shipping_postal_code: current_user.postal_code
    )

    if @order.save
      # Create order items
      @cart_items.each do |item|
        @order.order_items.create!(
          product: item[:product],
          quantity: item[:quantity],
          price: item[:product].price
        )

SELECT "products".* FROM "products" WHERE "products"."id" = 67 LIMIT 1
---
  def build_cart_items
    cart_items = []
    @cart.each do |product_id, quantity|
      product = Product.find(product_id)