app/controllers/home_controller.rb

  def index
    @featured_products = Product.limit(6)
    @categories = Category.all
---
SELECT "products".* FROM "products" LIMIT 6
SELECT "categories".* FROM "categories"

  def about
    @categories = Category.all
---
SELECT "categories".* FROM "categories"