app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = 22 ORDER BY "orders"."created_at" DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders" WHERE "orders"."user_id" = 22
---
  def index
    @orders = current_user.orders.includes(:order_items => :product)
                         .order(created_at: :desc)
                         .page(params[:page]).per(10)