app/controllers/products_controller.rb

  def index
    @products = Product.includes(:category)
    @categories = Category.all

    # Filter by category if specified
    if params[:category_id].present?
      @products = @products.where(category_id: params[:category_id])
      @current_category = Category.find(params[:category_id])
    end

    # Search functionality
    if params[:search].present?
      @products = @products.where("name ILIKE ? OR description ILIKE ?",
                                 "%#{params[:search]}%", "%#{params[:search]}%")
    end

    # Filter by category from dropdown
    if params[:category].present? && params[:category] != ""
      @products = @products.joins(:category).where(categories: { name: params[:category] })
    end

    @products = @products.page(params[:page]).per(12)
---
SELECT COUNT(*) FROM "products" INNER JOIN "categories" ON "categories"."id" = "products"."category_id" WHERE "categories"."name" = 'Women''s Swimwear'