app/controllers/products_controller.rb

  def index
    @products = Product.includes(:category).where(active: true)
    @categories = Category.all

    # Initialize search parameters
    @search_params = {
      search: params[:search],
      category: params[:category],
      filter: params[:filter]
    }

    # Apply search filters
    @products = apply_search_filters(@products)

    # Apply special filters
    @products = apply_special_filters(@products)

    # Handle category navigation (different from search)
    if params[:category_id].present?
      @products = @products.where(category_id: params[:category_id])
      @current_category = Category.find(params[:category_id])
    end

    @products = @products.page(params[:page]).per(12)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (8, 9)
SELECT "categories".* FROM "categories"
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 5 LIMIT 1
SELECT "products".* FROM "products" WHERE "products"."active" = 1 AND (name LIKE '%sss%' OR description LIKE '%sss%') LIMIT 12 OFFSET 0
SELECT COUNT(*) FROM (SELECT 1 AS one FROM "products" WHERE "products"."active" = 1 AND (updated_at >= '2025-07-31 22:21:15.103066' AND created_at < '2025-07-31 22:21:15.103281') LIMIT 12 OFFSET 0) subquery_for_count

  def show
    @related_products = Product.where(category: @product.category)
                              .where.not(id: @product.id)
                              .limit(4)
---
SELECT "products".* FROM "products" WHERE "products"."category_id" = 5 AND "products"."id" != 72 LIMIT 4