app/models/page.rb

SELECT "pages".* FROM "pages" WHERE "pages"."slug" = 'about' LIMIT 1
---
  def self.find_by_slug(slug)