app/models/user.rb

SELECT "users".* FROM "users" WHERE (lower(name) = 'admin' OR lower(email) = 'admin') ORDER BY "users"."id" ASC LIMIT 1
---
  def has_address?
    street_address.present? && city.present? && postal_code.present? && province.present?