app/views/categories/index.html.erb

            <p class="card-text">
              <strong><%= category.products.count %></strong> products available
---
SELECT COUNT(*) FROM "products" WHERE "products"."category_id" = 5