app/views/products/index.html.erb

            <%= f.label :category, "Filter by category", class: "form-label" %>
            <%= f.select :category,
                options_from_collection_for_select(@categories, :name, :name, params[:category]),
                { prompt: "All Categories" },
                { class: "form-select" } %>
---
SELECT "categories".* FROM "categories"


        Showing <%= pluralize(@products.count, 'product') %>
---
SELECT COUNT(*) FROM "products"